# TrussFamilyTopChordStartReleaseType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TrussFamilyTopChordStartReleaseType Property
ParameterTypeId Class See Also
---
"Start Release"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TrussFamilyTopChordStartReleaseType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussFamilyTopChordStartReleaseType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TrussFamilyTopChordStartReleaseType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace